ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/R5SS_TMU_1_00060000h.xml
		<bitfield id="CSAVE_R0" width="32" begin="31" end="0" resetval="0x0" description="Context save of R0 result register" range="31:0" rwaccess="R"/>
	</register><register id="TMU_1_CSAVE_R1" acronym="TMU_1_CSAVE_R1" offset="712" width="32" description="Context save of R1 result register.">
		<bitfield id="CSAVE_R1" width="32" begin="31" end="0" resetval="0x0" description="Context save of R1 result register" range="31:0" rwaccess="R"/>
	</register><register id="TMU_1_CSAVE_R2" acronym="TMU_1_CSAVE_R2" offset="720" width="32" description="Context save of R2 result register.">
		<bitfield id="CSAVE_R2" width="32" begin="31" end="0" resetval="0x0" description="Context save of R2 result register" range="31:0" rwaccess="R"/>
	</register><register id="TMU_1_CSAVE_R3" acronym="TMU_1_CSAVE_R3" offset="728" width="32" description="Context save of R3 result register.">
		<bitfield id="CSAVE_R3" width="32" begin="31" end="0" resetval="0x0" description="Context save of R3 result register" range="31:0" rwaccess="R"/>
	</register><register id="TMU_1_CSAVE_R4" acronym="TMU_1_CSAVE_R4" offset="736" width="32" description="Context save of R4 result register.">
		<bitfield id="CSAVE_R4" width="32" begin="31" end="0" resetval="0x0" description="Context save of R4 result register" range="31:0" rwaccess="R"/>
	</register><register id="TMU_1_CSAVE_R5" acronym="TMU_1_CSAVE_R5" offset="744" width="32" description="Context save of R5 result register.">
		<bitfield id="CSAVE_R5" width="32" begin="31" end="0" resetval="0x0" description="Context save of R5 result register" range="31:0" rwaccess="R"/>
	</register><register id="TMU_1_CSAVE_R6" acronym="TMU_1_CSAVE_R6" offset="752" width="32" description="Context save of R6 result register.">
		<bitfield id="CSAVE_R6" width="32" begin="31" end="0" resetval="0x0" description="Context save of R6 result register" range="31:0" rwaccess="R"/>
	</register><register id="TMU_1_CSAVE_R7" acronym="TMU_1_CSAVE_R7" offset="760" width="32" description="Context save of R7 result register.">
		<bitfield id="CSAVE_R7" width="32" begin="31" end="0" resetval="0x0" description="Context save of R7 result register" range="31:0" rwaccess="R"/>
	</register><register id="TMU_1_CSAVE_OP2" acronym="TMU_1_CSAVE_OP2" offset="768" width="32" description="Context save of Operarand2 result register.">
		<bitfield id="CSAVE_OP2" width="32" begin="31" end="0" resetval="0x0" description="Context save of operand 2 [OP2] result register" range="31:0" rwaccess="R"/>
	</register><register id="TMU_1_CONTEXT_SAVE" acronym="TMU_1_CONTEXT_SAVE" offset="776" width="32" description="Register to initiate context save of result registers.">
		<bitfield id="SAVE" width="1" begin="0" end="0" resetval="0x0" description="Writing one will initiate context save. Context save will be done only after completion all operations initiated by master before context save was issued. Results registers R0 to R3 and Operand2 will be saved. Note: Contex is saved within IP, not to external memory." range="0" rwaccess="R/W1TS"/>
	</register><register id="TMU_1_CONTEXT_RESTORE" acronym="TMU_1_CONTEXT_RESTORE" offset="784" width="32" description="Register to initiate context restore of result registers.">
		<bitfield id="RESTORE" width="1" begin="0" end="0" resetval="0x0" description="Writing one will initiate context restore. Results registers R0 to R3 and Operand2 will be restored." range="0" rwaccess="R/W1TS"/>
	</register><register id="TMU_1_STF" acronym="TMU_1_STF" offset="840" width="32" description="TMU status Register.">
		<bitfield id="LUF_WR_EN" width="1" begin="9" end="9" resetval="0x0" description="Always read as zero, Value is written to this bit either enables/disables write to LVF [[br]0:Disbles write to LUF 1:Enables write to LUF" range="9" rwaccess="R"/>
	<bitfield id="LVF_WR_EN" width="1" begin="8" end="8" resetval="0x0" description="Always read as zero, Value is written to this bit either enables/disables write to LVF [[br]0:Disbles write to LVF 1:Enables write to LVF" range="8" rwaccess="R"/>
	<bitfield id="LUF" width="1" begin="1" end="1" resetval="0x0" description="Is set to '1' when a TMU operation results in LVF. It is sticky bit, once set, it remains set until it is cleared with write. It can be written only when LUF_WR_EN Is written with '1'" range="1" rwaccess="R/W"/>
	<bitfield id="LVF" width="1" begin="0" end="0" resetval="0x0" description="Is set to '1' when a TMU operation results in LVF. It is sticky bit, once set, it remains set until it is cleared with write. It can be written only when LVF_WR_EN Is written with '1'" range="0" rwaccess="R/W"/>
	</register><register id="TMU_1_PARITY_TEST" acronym="TMU_1_PARITY_TEST" offset="896" width="32" description="Enabling the parity test feature.">
		<bitfield id="TESTEN" width="4" begin="3" end="0" resetval="0x0" description="1010: Parity test feature is enabled All other values: Parity test feature is disabled  Note: When the parity test feature is enabled, acutal registers are not accessible in the memory map. Instead, the parity values are accessible. Parity is computed for every byte and the correponding parity value is available at the bit-0 of every byte.  Value of '1' written to the parity bit after enabling the parity test feature can be used to inject the error by inverting the stored parity value." range="3:0" rwaccess="R/W"/>
	</register><register id="TMU_1_LCM_LOCK" acronym="TMU_1_LCM_LOCK" offset="912" width="32" description="LCM lock configuration.">
		<bitfield id="PARITY_TEST" width="1" begin="0" end="0" resetval="0x0" description="0: Register configuration is not locked. [[br]1:Register configuration is locked." range="0" rwaccess="R/W"/>
	</register><register id="TMU_1_LCM_COMMIT" acronym="TMU_1_LCM_COMMIT" offset="928" width="32" description="LCM commit configuration.">
		<bitfield id="PARITY_TEST" width="1" begin="0" end="0" resetval="0x0" description="0: Register lock configuration is not committed. [[br]1:Register lock configuration is committed. Once configuration is committed, only reset can change the configuration." range="0" rwaccess="R/W1TS"/>
	</register>
</module>